[{"date":"2022-01-02T23:06:17+00:00","title":"Dow Jones Futures Rise: Tesla Deliveries Crush Views, Stock Eyes Breakout; Bring On The 2022 Market Rally","content":"Tesla deliveries blew out Q4 forecasts after strong sales from Xpeng and Nio. How to start off the 2022 market rally right.","link":"https:\/\/finance.yahoo.com\/m\/aa0447b2-572a-32ae-8db5-6578cee14f08\/dow-jones-futures-rise%3A-tesla.html","symbols":["TSLA.US","XPEV.US","LI.US","AMD.US","DDOG.US","COMP.US","GSPC.INDX","DJI.INDX","IXIC.INDX"],"tags":["DOW JONES","STOCK MARKET","STOCK MARKET RALLY","AMD STOCK","TESLA STOCK","NASDAQ FUTURES","LI AUTO","VEHICLES","TESLA DELIVERIES"]},{"date":"2022-01-02T19:42:44+00:00","title":"Tesla Smashes Quarterly Delivery Record With 308,600 Cars","content":"(Bloomberg) -- Tesla Inc. delivered 308,600 vehicles worldwide in the fourth quarter, smashing the previous record for the electric-car maker and setting a capstone on a year in which the company joined the exclusive $1 trillion market valuation club.\n\nMost Read from Bloomberg\n\nBillionaires Are Embracing Crypto in Case Money ‘Goes to Hell’ Adams Urges Return to Class in NYC; U.S. Surges: Virus Update U.S. Housing Crisis Only Gets Worse as Population Shrinks Kids’ Covid Hospitalizations Hit Record in U.S. Omicron Surge Tesla Smashes Quarterly Delivery Record With 308,600 Cars\n\nThe better-than-expected results posted Sunday pushed Tesla’s total sales for the year to more than 936,000, up about 87% over 2020’s deliveries of just under a half-million vehicles. Thirteen analysts surveyed by Bloomberg on average had expected about 263,000 vehicles for the quarter, though some had revised their numbers upward in the final days of December.\n\nThe record quarter underscores the “green tidal wave taking hold” for Tesla and Chief Executive Officer Elon Musk heading into 2022, Daniel Ives, an analyst at Wedbush Securities, said in a note to clients. The strong results also point to robust demand in China and Tesla’s skill at navigating the global semiconductor shortage, he said. The company’s previous delivery record was 241,300, set in the third quarter.\n\n“This is a trophy-case quarter for Tesla as the company blew away even bull-case expectations,” Ives, who rates the shares as outperform and has a $1,400 price target, said in an email. He called it a “jaw-dropper performance for Musk & Co. in the December quarter with massive tailwinds into 2022.”\n\nCrypto trading suggests that Austin, Texas-based Tesla’s shares will rise when Wall Street wakes up Monday. Tesla tokens climbed 2% to $1,093 as of 2:38 p.m. in New York on the FTX crypto exchange after the deliveries were announced Sunday.\n\nThe EV market leader’s shares have soared on the back of expectations for continued growth, with the stock up almost 50% in 2021 and a market valuation exceeding $1 trillion -- one of only five publicly listed U.S.-based companies to achieve that status. The shares fell 1.3% on Dec. 31 to close at $1,056.78.\n\nStory continues\n\nMusk praised his crew for coming through, saying in a tweet that the numbers were the result of “great work by Tesla team worldwide.”\n\nQuarterly deliveries are one of the most closely watched indicators for Tesla. They underpin its financial results and are widely seen as a barometer of consumer demand for electric vehicles as a whole because the company has led the charge for battery-powered cars.\n\nRead more: Tesla cedes a bit of trillion-dollar value to end year\n\nTesla has said repeatedly it expects 50% annual increases in deliveries over a multi-year period. The seventh consecutive quarterly gain comes amid a global semiconductor slump that has crimped production at most other automakers and kept sales in check despite rising demand.\n\nMusk, who became the world’s richest person last year, has described 2021 as a “supply chain nightmare” even as his company continued to grow deliveries each quarter. It has fared better than other automakers due in part to efforts by its engineers to rewrite software to adapt to whatever chips they could find for other purposes.\n\nTesla has said its delivery counts should be viewed as slightly conservative, and final numbers could vary by 0.5% or more.\n\nDeliveries and actual production don’t necessarily match up one-for-one during any given quarter. Production was 305,840 for the fourth quarter and 930,422 for the year.\n\nThe company doesn’t break out sales by geography, but the U.S. and China are its largest markets and the bulk of sales were of the Model 3 and Y. Tesla currently makes the Model S, X, 3 and Y at its factory in Fremont, California, and the Model 3 and Y at its plant in Shanghai. In 2022, Tesla will be adding production capacity with two new factories coming online in Austin and Berlin.\n\nMusk has promised to provide an update on Tesla’s new product plans on the company’s next earnings call.\n\n(Updates with analyst comment in third paragraph)\n\nMost Read from Bloomberg Businessweek\n\nWhat Really Happens When Workers Are Given a Flexible Hybrid Schedule? How to ‘See’ Time: The Secret to Peak Entrepreneur Productivity Stop With the Covid Excuses, Already—Customers Have Caught On The Super League Debacle Forced Manchester United’s American Owners to Listen to Fans The Mannequin Fascination That Spurred a Sustainable Business\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/tesla-smashes-quarterly-delivery-record-194244396.html","symbols":["TWTR.US","TSLA.US","TWTR.MX","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX","TWTR34.SA","TWR.XETRA","TWR.F"],"tags":["BLOOMBERG","TESLA","ELON MUSK"]},{"date":"2022-01-02T19:11:00+00:00","title":"Tesla smashes quarterly delivery record, sees sales surge 87% in 2021","content":"Tesla Inc. delivered more than 308,000 vehicles in the fourth quarter, blowing away expectations, and saw sales surge about 87% in a year that saw it top $1 trillion in market cap for the first time.","link":"https:\/\/finance.yahoo.com\/m\/490d6cdc-ff60-37e8-9502-c918219891c5\/tesla-smashes-quarterly.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["TESLA","TESLA STOCK","ELON MUSK"]},{"date":"2022-01-02T17:53:00+00:00","title":"Tesla Reports 87% Growth in Annual Vehicle Deliveries","content":"The electric-vehicle maker’s expansion comes despite parts shortages and other logistical problems that have hamstrung the auto industry.","link":"https:\/\/finance.yahoo.com\/m\/19979a6d-a1e9-371d-a17f-246f5d82eef2\/tesla-reports-87%25-growth-in.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["LOGISTICAL PROBLEMS"]},{"date":"2022-01-02T16:45:11+00:00","title":"UPDATE 3-Tesla Q4 deliveries beat estimates despite supply chain woes","content":"(Adds background)\n\nJan 2 (Reuters) - Tesla Inc reported record quarterly deliveries that far exceeded Wall Street estimates, riding out global chip shortages as it ramped up China production.\n\nIt was the sixth consecutive quarter that the world's most valuable automaker posted record deliveries.\n\nTesla, led by billionaire CEO Elon Musk, delivered 308,600 vehicles in the fourth quarter, far higher than analysts' forecasts of 263,026 vehicles.\n\nTesla's October-December deliveries were up about 70% from a year earlier and nearly 30% higher from record deliveries the preceding quarter.\n\nTesla ramped up production in China even though competition rose and regulatory pressure mounted following consumer complaints over product safety.\n\nTesla ships China-made models to Europe and some Asian countries.\n\nTesla said it sold a total of 296,850 Model 3 compact cars and Model Y sport-utility vehicles in the fourth quarter.\n\nOn an annual basis, the automaker boosted its deliveries by 87% from a year earlier to 936,172 vehicles in 2021.\n\nTesla's 2020 deliveries fell slightly shy of its goal of half a million vehicles. Musk said in October last year that Tesla will be able to maintain an annual growth rate of more than 50% for \"quite a while.\"\n\nThe company is expected to boost its sales further this year, although there is uncertainty about how quickly it will increase production at new factories in Texas and Berlin.\n\nTesla said in October that it aimed to build its first production cars at both facilities by the end of 2021, but it is not known whether it met that target. Tesla did not respond to a question from Reuters about the plants. Its Berlin factory had initially been scheduled to begin production last summer.\n\nCredit Suisse expects Tesla to boost deliveries to 1.3 million vehicles in 2022, forecasting that production increases at existing factories in the United States and China will help offset slower production growth at its new factories.\n\nTesla hit over $1 trillion in market capitalization in October after rental car company Hertz said it was buying 100,000 of its vehicles. The company's shares lost some ground after Musk wrote on Twitter in November that he was considering selling 10% of his stake in Tesla.\n\nOverall, Tesla shares gained 50% last year. (Reporting by Hyunjoo Jin in San Francisco, Nivedita Balu and Sneha Bhowmik in Bengaluru; Editing by Daniel Wallis and Mark Porter)","link":"https:\/\/finance.yahoo.com\/news\/1-tesla-delivers-record-308-164511056.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["TESLA INC","ELON MUSK","DELIVERIES"]},{"date":"2022-01-02T16:44:00+00:00","title":"Tesla Deliveries Crushed Expectations.  The Stock Should Move Higher.","content":"Tesla delivered 308,600 vehicles in the fourth quarter, topping expectations. For the full year, deliveries came in at almost 936,000 units.","link":"https:\/\/finance.yahoo.com\/m\/134570d2-14b3-3c70-91d4-b142734aae78\/tesla-deliveries-crushed.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["TESLA","FOURTH QUARTER","TESLA STOCK"]},{"date":"2022-01-02T16:18:17+00:00","title":"Dow Jones Futures: Tesla Deliveries Crush Views, Xpeng, Nio Sales Strong; Bring On The 2022 Market Rally","content":"Tesla deliveries blew out Q4 forecasts after strong sales from Xpeng and Nio. How to start off the 2022 market rally right.","link":"https:\/\/finance.yahoo.com\/m\/aa0447b2-572a-32ae-8db5-6578cee14f08\/dow-jones-futures%3A-tesla.html","symbols":["TSLA.US","XPEV.US","LI.US","AMD.US","DDOG.US","COMP.US","GSPC.INDX","DJI.INDX","IXIC.INDX","TSLA34.SA","A1MD34.SA","TL0.XETRA","TL0.F","TSLA.MX","AMD.F","AMD.XETRA","AMD.MX"],"tags":["DOW JONES","STOCK MARKET","STOCK MARKET RALLY","AMD STOCK","TESLA STOCK","NASDAQ FUTURES","LI AUTO","TESLA DELIVERIES"]},{"date":"2022-01-02T16:12:48+00:00","title":"Tesla Q4 deliveries beat estimates despite supply chain woes","content":"(Reuters) -Tesla Inc reported record quarterly deliveries that far exceeded Wall Street estimates, riding out global chip shortages as it ramped up China production.\n\nIt was the sixth consecutive quarter that the world's most valuable automaker posted record deliveries.\n\nTesla, led by billionaire CEO Elon Musk, delivered 308,600 vehicles in the fourth quarter, far higher than analysts' forecasts of 263,026 vehicles.\n\nTesla's October-December deliveries were up about 70% from a year earlier and nearly 30% higher from record deliveries the preceding quarter.\n\nTesla ramped up production in China even though competition rose and regulatory pressure mounted following consumer complaints over product safety.\n\nTesla ships China-made models to Europe and some Asian countries.\n\nTesla said it sold a total of 296,850 Model 3 compact cars and Model Y sport-utility vehicles in the fourth quarter.\n\nOn an annual basis, the automaker boosted its deliveries by 87% from a year earlier to 936,172 vehicles in 2021.\n\nTesla's 2020 deliveries fell slightly shy of its goal of half a million vehicles. Musk said in October last year that Tesla will be able to maintain an annual growth rate of more than 50% for \"quite a while.\"\n\nThe company is expected to boost its sales further this year, although there is uncertainty about how quickly it will increase production at new factories in Texas and Berlin.\n\nTesla said in October that it aimed to build its first production cars at both facilities by the end of 2021, but it is not known whether it met that target. Tesla did not respond to a question from Reuters about the plants. Its Berlin factory had initially been scheduled to begin production last summer.\n\nCredit Suisse expects Tesla to boost deliveries to 1.3 million vehicles in 2022, forecasting that production increases at existing factories in the United States and China will help offset slower production growth at its new factories.\n\nTesla hit over $1 trillion in market capitalization in October after rental car company Hertz said it was buying 100,000 of its vehicles. The company's shares lost some ground after Musk wrote on Twitter in November that he was considering selling 10% of his stake in Tesla.\n\nOverall, Tesla shares gained 50% last year.\n\n(Reporting by Hyunjoo Jin in San Francisco, Nivedita Balu and Sneha Bhowmik in Bengaluru; Editing by Daniel Wallis and Mark Porter)","link":"https:\/\/finance.yahoo.com\/news\/tesla-delivers-308-600-vehicles-161248680.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["TESLA INC","ELON MUSK","DELIVERIES"]},{"date":"2022-01-02T16:05:00+00:00","title":"Tesla Q4 2021 Vehicle Production &amp; Deliveries","content":"AUSTIN, Texas, January 02, 2022--(BUSINESS WIRE)--In the fourth quarter, we achieved production of more than 305,000 vehicles and deliveries of over 308,000 vehicles. In 2021, we delivered over 936,000 vehicles.\n\nThank you to all of our customers, employees, suppliers, shareholders and supporters who helped us achieve a great year.\n\nQ4 2021 Production Deliveries Subject to\r\noperating lease\r\naccounting Model S\/X 13,109 11,750 17% Model 3\/Y 292,731 296,850 5% Total 305,840 308,600 5%\n\n2021 Production Deliveries Model S\/X 24,390 24,964 Model 3\/Y 906,032 911,208 Total 930,422 936,172\n\n***************\n\nOur net income and cash flow results will be announced along with the rest of our financial performance when we announce Q4 earnings. Our delivery count should be viewed as slightly conservative, as we only count a car as delivered if it is transferred to the customer and all paperwork is correct. Final numbers could vary by up to 0.5% or more. Tesla vehicle deliveries represent only one measure of the company’s financial performance and should not be relied on as an indicator of quarterly financial results, which depend on a variety of factors, including the cost of sales, foreign exchange movements and mix of directly leased vehicles.\n\nView source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20220102005017\/en\/\n\nContacts\n\nInvestor Relations Contact: \r\nir@tesla.com","link":"https:\/\/finance.yahoo.com\/news\/tesla-q4-2021-vehicle-production-160500947.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["TEXAS","AUSTIN","OPERATING LEASE","BUSINESS WIRE"]},{"date":"2022-01-02T13:18:17+00:00","title":"Dow Jones Futures: Tesla EV Deliveries Imminent After Strong Xpeng, Nio Sales; Bring On The 2022 Market Rally","content":"Xpeng and Nio reported strong EV deliveries with Tesla looming. Here's how to start off right in the 2022 market rally.","link":"https:\/\/finance.yahoo.com\/m\/aa0447b2-572a-32ae-8db5-6578cee14f08\/dow-jones-futures%3A-tesla-ev.html","symbols":["TSLA.US","XPEV.US","LI.US","AMD.US","DDOG.US","COMP.US","GSPC.INDX","DJI.INDX","IXIC.INDX","TSLA34.SA","A1MD34.SA","TL0.XETRA","TL0.F","TSLA.MX","AMD.F","AMD.XETRA","AMD.MX"],"tags":["DOW JONES","STOCK MARKET","STOCK MARKET RALLY","TESLA","AMD STOCK","NIO","TESLA STOCK","LI AUTO","MARKET RALLY"]},{"date":"2022-01-02T13:17:00+00:00","title":"Reddit and Crypto: Doge, Bitcoin, Elon Musk, and a Look Back at 2021","content":"Whether you follow Reddit or even really knew what it is before 2021, you almost certainly know about the online discussion community now. Reddit users drove a lot of action and discussion when it came to creating meme stocks and the site has been a major source for people looking to talk about cryptocurrency. \"In 2021, there were a lot of conversations on Reddit, but none more prominent than cryptocurrency,\" the company wrote in its year-end report.","link":"https:\/\/finance.yahoo.com\/m\/14e6dbeb-370e-3c9e-ba07-aa4a5480be4e\/reddit-and-crypto%3A-doge%2C.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["REDDIT"]},{"date":"2022-01-02T12:53:00+00:00","title":"Is Space X Really Heading for a Crash?","content":"A panicked email from Elon Musk elicits little more than a shrug and a knowing smile from space investors.","link":"https:\/\/finance.yahoo.com\/m\/e4cf38f4-50ad-34a1-8c36-c8a4222f3a94\/is-space-x-really-heading-for.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["TESLA","ELON MUSK","SPACEX","STARSHIP"]},{"date":"2022-01-02T12:02:00+00:00","title":"Tesla Delivers a Record 308,000 Vehicles in the Fourth Quarter","content":"Tesla delivered a record 308,000 vehicles in the fourth quarter, a record for the electric vehicle (EV) company. Tesla vehicle deliveries represent only one measure of the company's financial performance and should not be relied on as an indicator of quarterly financial results, which depend on a variety of factors, including the cost of sales, foreign exchange movements, and mix of directly leased vehicles. Tesla delivered just under 500,000 vehicles in 2020.","link":"https:\/\/finance.yahoo.com\/m\/e543dcf9-6a7e-30d6-b5f0-e72aa7e0a8c8\/tesla-delivers-a-record.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":[]},{"date":"2022-01-02T10:06:00+00:00","title":"4 Cryptocurrencies to Avoid Like the Plague in 2022","content":"What's clear from this increase is that investors are excited about the financial and nonfinancial applications of blockchain, the future of a potentially decentralized metaverse, and the transparency that blockchain technology brings to the table. Avoid any tokens inspired by the Shiba Inu in 2022. If there's one very simple theme I can pass along to cryptocurrency investors in 2022, it's to avoid any coins based on the Shiba Inu dog breed or named after Elon Musk.","link":"https:\/\/finance.yahoo.com\/m\/f7c18e92-bebf-358f-bb1b-f6d479f26f11\/4-cryptocurrencies-to-avoid.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["ELON MUSK","BLOCKCHAIN","DIGITAL CURRENCIES","SHIBA INU DOG BREED","KIMBAL MUSK","SHIBA INU","FLOKI INU"]},{"date":"2022-01-01T18:13:17+00:00","title":"Dow Jones Futures: 2022 Market Rally? Bring It On; Xpeng, Nio EV Deliveries Strong With Tesla On Tap","content":"Xpeng and Nio reported strong EV deliveries with Tesla looming. Here's how to start off right in the 2022 market rally.","link":"https:\/\/finance.yahoo.com\/m\/aa0447b2-572a-32ae-8db5-6578cee14f08\/dow-jones-futures%3A-2022.html","symbols":["TSLA.US","XPEV.US","LI.US","AMD.US","DDOG.US","COMP.US","GSPC.INDX","DJI.INDX","IXIC.INDX","TSLA34.SA","A1MD34.SA","TL0.XETRA","TL0.F","TSLA.MX","AMD.F","AMD.XETRA","AMD.MX"],"tags":["DOW JONES","STOCK MARKET","TESLA","AMD STOCK","TESLA STOCK","NASDAQ FUTURES","LI AUTO"]},{"date":"2022-01-01T14:09:17+00:00","title":"Dow Jones Futures: Xpeng, Nio EV Deliveries Strong With Tesla On Tap; Bring On The 2022 Market Rally","content":"Xpeng and Nio reported strong EV deliveries with Tesla looming. Here's how to start off right in the 2022 market rally.","link":"https:\/\/finance.yahoo.com\/m\/aa0447b2-572a-32ae-8db5-6578cee14f08\/dow-jones-futures%3A-xpeng%2C-nio.html","symbols":["TSLA.US","XPEV.US","LI.US","AMD.US","DDOG.US","COMP.US","GSPC.INDX","DJI.INDX","IXIC.INDX","TSLA34.SA","A1MD34.SA","TL0.XETRA","TL0.F","TSLA.MX","AMD.F","AMD.XETRA","AMD.MX"],"tags":["DOW JONES","STOCK MARKET","TESLA","AMD STOCK","TESLA STOCK","NASDAQ FUTURES","LI AUTO"]},{"date":"2022-01-01T13:38:40+00:00","title":"Nio, Xpeng, Li Auto Report Strong December Sales As This Dark Horse Emerges In China's EV Race","content":"Th three China EV startups reported strong December deliveries. China's BYD will look to top the 100,000 vehicles mark.","link":"https:\/\/finance.yahoo.com\/m\/6162b9f6-a50a-3490-9032-cd64e06f6592\/nio%2C-xpeng%2C-li-auto-report.html","symbols":["TSLA.US","XPEV.US","LI.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["CHINA","NIO","XPENG MOTORS","SALES TARGETS","LI"]},{"date":"2022-01-01T11:25:00+00:00","title":"Will JD.com Be Worth More Than Tesla by 2032?","content":"Since the market bottom during the onslaught of the pandemic, Tesla (NASDAQ: TSLA) has returned over 1,400% for investors, a return only a few meme stocks can rival. Its meteoric rise helped the electric vehicle maker break through the trillion-dollar valuation, and it's now worth more than the next 30 or so auto manufacturers combined! To put that in perspective, Tesla has delivered over 628,000 EVs through the first three quarters of 2021, and if it should sell another 270,000 or so, it will have delivered 900,000 vehicles this year, a phenomenal growth record for the EV industry leader.","link":"https:\/\/finance.yahoo.com\/m\/1d4009d8-91bf-3916-9d5e-ec67558412e8\/will-jd.com-be-worth-more.html","symbols":["TSLA.US","JD.US","AMZN.US","AMZO34.SA","TSLA34.SA","AMZ.XETRA","JDCMF.US","AMZ.F","AMZN.MX","TL0.XETRA","TL0.F","TSLA.MX","9618.HK","013A.F"],"tags":["TESLA","INTERNET RETAILER"]},{"date":"2022-01-01T11:06:00+00:00","title":"Investing in This ETF Right Now Could Make You a Millionaire Retiree","content":"If you're like a large number of other investors, sitting on a stake in the Invesco QQQ Trust (NASDAQ: QQQ) is a little bit intimidating. While exchange-traded funds are supposed to be less volatile and inherently diversified, the so-called QQQs often feel like they're anything but. Not only are they made top-heavy by significant exposure to Nasdaq-listed behemoths like Apple and Microsoft, the Invesco QQQ Trust is overconcentrated with technology stocks.","link":"https:\/\/finance.yahoo.com\/m\/41bcf332-aa02-30ff-bc4a-d817788dd64a\/investing-in-this-etf-right.html","symbols":["TSLA.US","NVDA.US","AMZN.US","IVZ.US","NDAQ.US","AMZO34.SA","NVDC34.SA","TSLA34.SA","AMZ.XETRA","3IW.F","NAQ.F","AMZ.F","AMZN.MX","TL0.XETRA","TL0.F","TSLA.MX","NVD.XETRA","NVD.F","NVDA.MX","QQQ.US"],"tags":["NASDAQ","APPLE","NASDAQ 100","QQQ","INVESCO QQQ TRUST"]},{"date":"2022-01-01T00:30:00+00:00","title":"Weekend Wheels: Top driver's picks for 2021, an electric year like no other","content":"Our reviewer checked out more than 50 vehicles in 2021, including five full-electrics, some over-the-top luxury vehicles and a few spiffy crossovers. Which did she like better, Tesla or one of its rivals? Read on and find out.","link":"https:\/\/finance.yahoo.com\/m\/94b291bb-2f79-3277-9605-7c80e87b46d0\/weekend-wheels%3A-top-driver%27s.html","symbols":["TSLA.US","TSLA34.SA","TL0.XETRA","TL0.F","TSLA.MX"],"tags":["LUXURY VEHICLES","GAS AND ELECTRIC","CROSSOVER DESIGN"]},{"date":"2022-01-01T00:07:17+00:00","title":"Dow Jones Futures: Tesla, Nio EV Deliveries In Focus; Bring On The 2022 Market Rally","content":"Tesla and other EV makers are about to report year-end deliveries. Here's how to start off investing right in 2022.","link":"https:\/\/finance.yahoo.com\/m\/aa0447b2-572a-32ae-8db5-6578cee14f08\/dow-jones-futures%3A-tesla%2C-nio.html","symbols":["TSLA.US","XPEV.US","LI.US","AMD.US","DDOG.US","COMP.US","GSPC.INDX","DJI.INDX","IXIC.INDX","TSLA34.SA","A1MD34.SA","TL0.XETRA","TL0.F","TSLA.MX","AMD.F","AMD.XETRA","AMD.MX"],"tags":["DOW JONES","STOCK MARKET","STOCK MARKET RALLY","TESLA","CHINA","AMD STOCK","TESLA STOCK","LI AUTO","MARKET RALLY"]}]